import React from 'react';
import { Card, CardBody, CardImg } from 'reactstrap';
import Unity from '../../assets/images/courses/XamarineForms.jpg';

const SingleCourseContentData = () => {
	return (
		<Card className='course-co text-right my-4'>
			<CardImg src={Unity} />
			<CardBody>
				<h1>آموزش سی شارپ در یونیتی مقدماتی تا پیشرفته</h1>
				<p>
					به نام خدا سلام عرفان شادبخت هستم با یه دوره آموزشی و جذاب و کاربدی در
					خدمت شما.
				</p>
				<p>
					در این دوره میخوایم از صفر تا صد بازی سازی با انجین یونیتی رو یاد
					بگیریم. خب با توجه به اینکه یونیتی محبوب ترین انجین بازی سازی و جزو
					&nbsp;موتور برتر بازی &nbsp;سازی هست تصمیم گرفتیم که این انجین رو از
					صفر تا صد آموزش بدیم.
				</p>
				<p>
					پیش نیاز ها : هیچ پیشنیازی لازم نیست فقط گیمر بودن برای دانستن یک سری
					مفاهیم که در طول دوره کامل توضیح میدیم
				</p>
				<p>
					این دوره دارای پنج فصل هست و توصیه میکنم اگه میخواین یه بازی ساز حرفه
					ای و پر درآمد بشین حتما این دوره رو ببینین
				</p>
				<p>
					فصل ها هر کدام دارای ریز فصل ها هستند که به خاطر زیاد بودن آنهارا در
					ویدوی معرفی کامل توضیح میدم
				</p>
				<p>
					1-بررسی صفر تا 100 سی شارپ در یونیتی
					<br />
					2-بررسی خود یونیتی
					<br />
					3-شروع بازی سازی به صورت حرفه ای
					<br />
					4-پروژه های عملی خفن
					<br />
					5-خروجی گرفتن و خداحافظی
				</p>
				<p>
					پروژه های عملی مثل قارچ خور ، شوتر اول یا سوم شخص(پلیر خودش تصمیم
					بگیره که اول شخص باشه یا سوم شخص) ، بازی حدس و گمان ، بازی دوبعدی جنگی
					، یک هوش مصنوعی کوچک ماشین بازی و.... ما در این دوره حدود ده تا پروژه
					عملی داریم و یک خبر خوب دیگه تایم لاین رو تا حدی بررسی میکنیم
				</p>
				<p>با آرزوی سلامتی و موفقیت&nbsp;</p>
			</CardBody>
		</Card>
	);
};

export default SingleCourseContentData;
